# NetworkEnergyEquationNotConverge Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..NetworkEnergyEquationNotConverge Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
The energy calculation could not be performed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NetworkEnergyEquationNotConverge { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NetworkEnergyEquationNotConverge As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NetworkEnergyEquationNotConverge {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace